; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
  (:requirements :strips :typing)
  (:types block name)
  (:predicates (on ?x - block ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       (name ?x - block ?y - name)
	       )

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x - block ?y - block)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x - block ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y))))
(:action wait
 :parameters ()
 :precondition (and)
 :effect (and)
)

)

; problem
(define (problem BLOCKS)
(:domain BLOCKS)
(:objects A E P S T H Y O G D C L R I B - block)
(:INIT   (ONTABLE A)
         (ON B A)
         (CLEAR O) (ON O B)
         (ON E P)
         (ON I E) (CLEAR I)
         (ONTABLE P)
         (ONTABLE S)
         (ON T S) 
         (CLEAR T)
         (ONTABLE Y)
         (ON L Y) (CLEAR L) 
         (ONTABLE G) 
         (ON R G)(CLEAR R)
         (ONTABLE C) 
         (CLEAR C)
         (ONTABLE D)
         (CLEAR H) (ON H D)
         (HANDEMPTY)
)
(:goal (AND 
        (ONTABLE P)
        (ON I P)
        (ON L I)
        (ON S L)
        )
    )
)

; plan
1. (unstack i e)
   deleted: (clear i) (handempty) (on i e)
   added: (holding i) (clear e)
   goals met: 1 of 4
2. (stack i t)
   deleted: (holding i) (clear t)
   added: (clear i) (handempty) (on i t)
   goals met: 1 of 4
3. (unstack e p)
   deleted: (clear e) (handempty) (on e p)
   added: (holding e) (clear p)
   goals met: 1 of 4
4. (stack e r)
   deleted: (holding e) (clear r)
   added: (clear e) (handempty) (on e r)
   goals met: 1 of 4
5. (unstack i t)
   deleted: (clear i) (handempty) (on i t)
   added: (holding i) (clear t)
   goals met: 1 of 4
6. (stack i p)
   deleted: (holding i) (clear p)
   added: (clear i) (handempty) (on i p)
   goals met: 2 of 4
7. (unstack l y)
   deleted: (clear l) (handempty) (on l y)
   added: (holding l) (clear y)
   goals met: 2 of 4
8. (stack l i)
   deleted: (holding l) (clear i)
   added: (clear l) (handempty) (on l i)
   goals met: 3 of 4
9. (unstack t s)
   deleted: (clear t) (handempty) (on t s)
   added: (holding t) (clear s)
   goals met: 3 of 4
10. (stack t o)
   deleted: (holding t) (clear o)
   added: (clear t) (handempty) (on t o)
   goals met: 3 of 4
11. (pick-up s)
   deleted: (ontable s) (clear s) (handempty)
   added: (holding s)
   goals met: 3 of 4
12. (stack s l)
   deleted: (holding s) (clear l)
   added: (clear s) (handempty) (on s l)
   goals met: 4 of 4
